# 10.1 GroupBy Mechanics

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'key1': ['a','a','b','b','a','a'],
    'key2': ['one','two','one','two','three','one'],
    'd1': np.random.randn(6),
    'd2': np.random.randn(6)
})
df

  key1   key2        d1        d2
0    a    one  0.535339 -0.394313
1    a    two  1.706831 -2.246436
2    b    one -1.213963 -0.332702
3    b    two  1.737554  1.105613
4    a  three -0.560776  0.006069
5    a    one -0.187952 -0.550603

In [3]:
grouped = df['d1'].groupby(df['key1'])
grouped1 = df['d2'].groupby(df['key2'])
grouped2 = df['d1'].groupby([df['key1'], df['key2']]).mean()
grouped4 = df.groupby(df['key1'])

In [4]:
grouped.mean()

key1
a    0.373361
b    0.261796
Name: d1, dtype: float64

In [5]:
grouped1.mean()

key2
one     -0.425873
three    0.006069
two     -0.570411
Name: d2, dtype: float64

In [6]:
grouped2

key1  key2
a     one      0.173694
      three   -0.560776
      two      1.706831
b     one     -1.213963
      two      1.737554
Name: d1, dtype: float64

In [7]:
grouped4.mean()

            d1        d2
key1
a     0.373361 -0.796321
b     0.261796  0.386456

In [8]:
print(df)
print('\n')
print('\n')
for (k1,k2), group in df.groupby(['key1','key2']):
#     print(k1)
#     print(k2)
    print(group)

  key1   key2        d1        d2
0    a    one  0.535339 -0.394313
1    a    two  1.706831 -2.246436
2    b    one -1.213963 -0.332702
3    b    two  1.737554  1.105613
4    a  three -0.560776  0.006069
5    a    one -0.187952 -0.550603




  key1 key2        d1        d2
0    a  one  0.535339 -0.394313
5    a  one -0.187952 -0.550603
  key1   key2        d1        d2
4    a  three -0.560776  0.006069
  key1 key2        d1        d2
1    a  two  1.706831 -2.246436
  key1 key2        d1        d2
2    b  one -1.213963 -0.332702
  key1 key2        d1        d2
3    b  two  1.737554  1.105613

In [9]:
pieces = dict(list(df.groupby('key1')))

In [10]:
pieces['a']

  key1   key2        d1        d2
0    a    one  0.535339 -0.394313
1    a    two  1.706831 -2.246436
4    a  three -0.560776  0.006069
5    a    one -0.187952 -0.550603

In [11]:
pieces['b']

  key1 key2        d1        d2
2    b  one -1.213963 -0.332702
3    b  two  1.737554  1.105613

In [12]:
# we could group the columns of our example df here by dtype

In [13]:
df.dtypes

key1     object
key2     object
d1      float64
d2      float64
dtype: object

In [14]:
groupByType = df.groupby(df.dtypes, axis=1)

In [15]:
groupByType

In [16]:
for dtype, group in groupByType:
    print(dtype)
    print(group)

float64
         d1        d2
0  0.535339 -0.394313
1  1.706831 -2.246436
2 -1.213963 -0.332702
3  1.737554  1.105613
4 -0.560776  0.006069
5 -0.187952 -0.550603
object
  key1   key2
0    a    one
1    a    two
2    b    one
3    b    two
4    a  three
5    a    one

In [17]:
df.groupby('key1')['d1'].mean()

key1
a    0.373361
b    0.261796
Name: d1, dtype: float64

In [18]:
df.groupby(['key1','key2'])['d1','d2'].mean()

                  d1        d2
key1 key2
a    one    0.173694 -0.472458
     three -0.560776  0.006069
     two    1.706831 -2.246436
b    one   -1.213963 -0.332702
     two    1.737554  1.105613

In [19]:
df.groupby(['key1','key2']).mean()

                  d1        d2
key1 key2
a    one    0.173694 -0.472458
     three -0.560776  0.006069
     two    1.706831 -2.246436
b    one   -1.213963 -0.332702
     two    1.737554  1.105613

In [20]:
df

  key1   key2        d1        d2
0    a    one  0.535339 -0.394313
1    a    two  1.706831 -2.246436
2    b    one -1.213963 -0.332702
3    b    two  1.737554  1.105613
4    a  three -0.560776  0.006069
5    a    one -0.187952 -0.550603

# Use loc[] to choose rows and columns by label.
 

# Use iloc[] to choose rows and columns by position.

In [21]:
#2:3 can be changed to [2]-> which rows to be taken
#[0,1,3,2] which columns to take into account

df.iloc[2:3,[0,1,2,3]]

  key1 key2        d1        d2
2    b  one -1.213963 -0.332702

In [22]:
df.iloc[0:2,1:2]

  key2
0  one
1  two

In [23]:
df.iloc[0:2,[1,2]]

  key2        d1
0  one  0.535339
1  two  1.706831

In [24]:
df

  key1   key2        d1        d2
0    a    one  0.535339 -0.394313
1    a    two  1.706831 -2.246436
2    b    one -1.213963 -0.332702
3    b    two  1.737554  1.105613
4    a  three -0.560776  0.006069
5    a    one -0.187952 -0.550603

In [25]:
df.set_index('key1', inplace=True)
df

       key2        d1        d2
key1
a       one  0.535339 -0.394313
a       two  1.706831 -2.246436
b       one -1.213963 -0.332702
b       two  1.737554  1.105613
a     three -0.560776  0.006069
a       one -0.187952 -0.550603

In [26]:
df.loc[:,'d1']

key1
a    0.535339
a    1.706831
b   -1.213963
b    1.737554
a   -0.560776
a   -0.187952
Name: d1, dtype: float64

In [27]:
df.loc['b',:]

     key2        d1        d2
key1
b     one -1.213963 -0.332702
b     two  1.737554  1.105613

In [28]:
df.loc['b','d1']

key1
b   -1.213963
b    1.737554
Name: d1, dtype: float64

In [29]:
df.loc[['a','b'],['d1','key2']]

            d1   key2
key1
a     0.535339    one
a     1.706831    two
a    -0.560776  three
a    -0.187952    one
b    -1.213963    one
b     1.737554    two

In [30]:
# select rows based on columnn value
df.loc[df.loc[:,'d1']>-1.0,:]

       key2        d1        d2
key1
a       one  0.535339 -0.394313
a       two  1.706831 -2.246436
b       two  1.737554  1.105613
a     three -0.560776  0.006069
a       one -0.187952 -0.550603

In [31]:
#Grouping with Dicts and Series

In [32]:
people = pd.DataFrame(np.random.randn(5,5),
                     columns=['a','b','c','d','e'],
                     index=['J','B','K','L','T'])

In [33]:
people

          a         b         c         d         e
J  0.761334  0.812820 -1.200734  1.614340  0.757156
B -0.687761 -0.439377 -0.302208  0.978116 -2.601086
K -0.068077 -0.379644  1.112399  0.112342  0.358535
L -1.566816 -0.953429  0.179025 -0.701998  1.381238
T  0.214581 -2.069159 -1.022803 -0.832108 -1.067162

In [34]:
people.iloc[2:3,[1,2]]=np.nan

In [35]:
people

          a         b         c         d         e
J  0.761334  0.812820 -1.200734  1.614340  0.757156
B -0.687761 -0.439377 -0.302208  0.978116 -2.601086
K -0.068077       NaN       NaN  0.112342  0.358535
L -1.566816 -0.953429  0.179025 -0.701998  1.381238
T  0.214581 -2.069159 -1.022803 -0.832108 -1.067162

In [36]:
# Now, suppose I have a group correspondence for the columns and want to sum
# together the columns by group

In [37]:
mapping={'a':'red','b':'green','c':'blue','d':'yellow','e':'orange','f':'maroon'}

In [38]:
mapping

{'a': 'red',
 'b': 'green',
 'c': 'blue',
 'd': 'yellow',
 'e': 'orange',
 'f': 'maroon'}

In [39]:
# you could construct an array from this dict to pass to groupby , but instead we
# can just pass the dict (I included the key 'f' to highlight that unused grouping keys
# are OK)
byColumn = people.groupby(mapping, axis=1)

In [40]:
byColumn.sum()

       blue     green    orange       red    yellow
J -1.200734  0.812820  0.757156  0.761334  1.614340
B -0.302208 -0.439377 -2.601086 -0.687761  0.978116
K  0.000000  0.000000  0.358535 -0.068077  0.112342
L  0.179025 -0.953429  1.381238 -1.566816 -0.701998
T -1.022803 -2.069159 -1.067162  0.214581 -0.832108

In [41]:
map_series = pd.Series(mapping)

In [42]:
map_series

a       red
b     green
c      blue
d    yellow
e    orange
f    maroon
dtype: object

In [43]:
bySeries = people.groupby(map_series, axis=1)

In [44]:
bySeries.sum()

       blue     green    orange       red    yellow
J -1.200734  0.812820  0.757156  0.761334  1.614340
B -0.302208 -0.439377 -2.601086 -0.687761  0.978116
K  0.000000  0.000000  0.358535 -0.068077  0.112342
L  0.179025 -0.953429  1.381238 -1.566816 -0.701998
T -1.022803 -2.069159 -1.067162  0.214581 -0.832108

In [45]:
# Practice
# selecting subsets from dataframe
dataFrames = pd.DataFrame({
    'state': ['NY','TX','FL','AL','AK','TX','TX'],
    'color': ['blue','green','red','white','grey','yellow','orange'],
    'food': ['Steak','Dal','Lamb','Pork','Beef','Burger','Pasta'],
    'age':[30,21,12,36,45,90,54],
    'height':[165,170,185,140,190,163,178],
    'score':[5.5,4.3,1.2,9.6,8.3,6.5,7.3]
}, index = ['Jane','Niko','Aaron','Penelope','Dean','Cristina','Cornella'])

In [46]:
dataFrames

         state   color    food  age  height  score
Jane        NY    blue   Steak   30     165    5.5
Niko        TX   green     Dal   21     170    4.3
Aaron       FL     red    Lamb   12     185    1.2
Penelope    AL   white    Pork   36     140    9.6
Dean        AK    grey    Beef   45     190    8.3
Cristina    TX  yellow  Burger   90     163    6.5
Cornella    TX  orange   Pasta   54     178    7.3

In [47]:
dataFrames.loc[:,['color','age','height']]

           color  age  height
Jane        blue   30     165
Niko       green   21     170
Aaron        red   12     185
Penelope   white   36     140
Dean        grey   45     190
Cristina  yellow   90     163
Cornella  orange   54     178

In [48]:
dataFrames.loc[['Aaron','Dean'],:]

      state color  food  age  height  score
Aaron    FL   red  Lamb   12     185    1.2
Dean     AK  grey  Beef   45     190    8.3

In [49]:
dataFrames.loc[['Aaron','Dean'],['color','age','height']]

      color  age  height
Aaron   red   12     185
Dean   grey   45     190

In [50]:
index = dataFrames.index
columns = dataFrames.columns
values = dataFrames.values

In [51]:
index

Index(['Jane', 'Niko', 'Aaron', 'Penelope', 'Dean', 'Cristina', 'Cornella'], dtype='object')

In [52]:
columns

Index(['state', 'color', 'food', 'age', 'height', 'score'], dtype='object')

In [53]:
values

array([['NY', 'blue', 'Steak', 30, 165, 5.5],
       ['TX', 'green', 'Dal', 21, 170, 4.3],
       ['FL', 'red', 'Lamb', 12, 185, 1.2],
       ['AL', 'white', 'Pork', 36, 140, 9.6],
       ['AK', 'grey', 'Beef', 45, 190, 8.3],
       ['TX', 'yellow', 'Burger', 90, 163, 6.5],
       ['TX', 'orange', 'Pasta', 54, 178, 7.3]], dtype=object)

In [54]:
dataFrames

         state   color    food  age  height  score
Jane        NY    blue   Steak   30     165    5.5
Niko        TX   green     Dal   21     170    4.3
Aaron       FL     red    Lamb   12     185    1.2
Penelope    AL   white    Pork   36     140    9.6
Dean        AK    grey    Beef   45     190    8.3
Cristina    TX  yellow  Burger   90     163    6.5
Cornella    TX  orange   Pasta   54     178    7.3

In [55]:
dataFrames.iloc[:,[1,2,4]]

           color    food  height
Jane        blue   Steak     165
Niko       green     Dal     170
Aaron        red    Lamb     185
Penelope   white    Pork     140
Dean        grey    Beef     190
Cristina  yellow  Burger     163
Cornella  orange   Pasta     178

In [56]:
dataFrames.iloc[[2,4],:]

      state color  food  age  height  score
Aaron    FL   red  Lamb   12     185    1.2
Dean     AK  grey  Beef   45     190    8.3

In [57]:
dataFrames.iloc[[2,4],[1,2,4]]

      color  food  height
Aaron   red  Lamb     185
Dean   grey  Beef     190

# 10.2 Data Aggregation
###  Aggregations refer to any data transformation that produces scalar values from arrays.

In [60]:
df = pd.DataFrame({
    'key1': ['a','a','b','b','a','a'],
    'key2': ['one','two','one','two','three','one'],
    'd1': np.random.randn(6),
    'd2': np.random.randn(6)
})
df

  key1   key2        d1        d2
0    a    one -0.208764 -0.842190
1    a    two -0.743606 -0.209776
2    b    one -1.297901  0.119113
3    b    two  0.073680 -0.021129
4    a  three  1.396790  0.140369
5    a    one -0.878292  1.648030

In [61]:
grouped = df.groupby('key2')

In [62]:
grouped['d1'].mean()

key2
one     -0.794985
three    1.396790
two     -0.334963
Name: d1, dtype: float64

In [63]:
grouped['d1'].quantile(0.9)

key2
one     -0.342669
three    1.396790
two     -0.008048
Name: d1, dtype: float64

In [69]:
def arrMax(arr):
    return arr.max()-arr.min()

In [70]:
grouped.agg(arrMax)

             d1        d2
key2
one    1.089137  2.490220
three  0.000000  0.000000
two    0.817287  0.188647

In [92]:
newDf = pd.DataFrame({
    "total_bill": np.random.randint(10000,size=6),
    "tip": np.random.randn(6),
    "smoker": ['no','no','no','no','no','no'],
    "day": ['sun','sun','sun','sun','sun','sun'],
    'time': ['dinner','dinner','dinner','dinner','dinner','dinner'],
    "size": np.random.randint(78, size=6),
    "tip_pct": np.random.randn(6)
    
    
})
newDf

   total_bill       tip smoker  day    time  size   tip_pct
0        9891 -0.003454     no  sun  dinner    45 -0.854909
1         474  0.474368     no  sun  dinner    24  0.161536
2        5377 -1.303035     no  sun  dinner    72  3.429286
3        1089  1.356533     no  sun  dinner    71  0.343984
4        7088 -0.146742     no  sun  dinner    44 -0.795312
5        2363 -0.408952     no  sun  dinner    73 -0.406539

In [89]:
grouped = newDf.groupby(['day','smoker'])

In [90]:
grouped.mean()

            total_bill       tip       size   tip_pct
day smoker
sun no       -0.623257 -0.382671  42.833333  0.802358

In [93]:
group_pct = grouped['tip_pct']

In [95]:
group_pct.agg('mean')

day  smoker
sun  no        0.802358
Name: tip_pct, dtype: float64

In [96]:
group_pct.agg(['mean','std',arrMax])

                mean      std    arrMax
day smoker
sun no      0.802358  1.40031  4.305436

In [98]:
group_pct.agg([('foo_mean_value','mean'),('bar_std_value','std')])

            foo_mean_value  bar_std_value
day smoker
sun no            0.802358        1.40031

In [99]:
grouped.agg(['mean','std'])

           total_bill                 tip                 size             \
                 mean       std      mean       std       mean        std
day smoker
sun no      -0.623257  1.013473 -0.382671  1.445399  42.833333  29.862463

             tip_pct
                mean      std
day smoker
sun no      0.802358  1.40031

In [102]:
# To start, suppose we
# wanted to compute the same three statistics for the tip_pct and total_bill
# columns

functions = ['count','mean','max']
results = grouped['tip_pct','total_bill']

In [104]:
results.agg(functions)

           tip_pct                     total_bill
             count      mean       max      count      mean       max
day smoker
sun no           6  0.802358  2.880154          6 -0.623257  0.969562

# Quantile and Bucket Analysis

In [106]:
frame = pd.DataFrame({
    'data1':np.random.randn(1000),
    'data2':np.random.randn(1000)
})

In [107]:
frame.head(3)

      data1     data2
0 -0.017055  0.311692
1 -1.002658  0.232250
2 -1.420847  0.323958

In [108]:
quartiles = pd.cut(frame['data1'], bins=50)

In [110]:
quartiles[:10]

0    (-0.0424, 0.0887]
1      (-1.092, -0.96]
2     (-1.485, -1.354]
3     (-0.567, -0.436]
4     (-1.354, -1.223]
5    (-0.0424, 0.0887]
6        (0.22, 0.351]
7     (-0.698, -0.567]
8        (0.22, 0.351]
9       (0.876, 1.007]
Name: data1, dtype: category
Categories (50, interval[float64]): [(-3.197, -3.059] < (-3.059, -2.928] < (-2.928, -2.797] < (-2.797, -2.665] ... (2.843, 2.974] < (2.974, 3.105] < (3.105, 3.236] < (3.236, 3.368]]

In [115]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),'count': group.count(), 'mean': group.mean()}

In [120]:
grouped = frame.data2.groupby(quartiles)
quartiles

0      (-0.0424, 0.0887]
1        (-1.092, -0.96]
2       (-1.485, -1.354]
3       (-0.567, -0.436]
4       (-1.354, -1.223]
5      (-0.0424, 0.0887]
6          (0.22, 0.351]
7       (-0.698, -0.567]
8          (0.22, 0.351]
9         (0.876, 1.007]
10        (1.138, 1.269]
11      (-0.567, -0.436]
12     (-0.0424, 0.0887]
13        (1.138, 1.269]
14        (0.876, 1.007]
15         (0.22, 0.351]
16      (-0.305, -0.174]
17     (-0.174, -0.0424]
18        (0.613, 0.745]
19         (0.22, 0.351]
20          (1.4, 1.531]
21     (-0.174, -0.0424]
22      (-1.879, -1.747]
23        (0.0887, 0.22]
24      (-1.879, -1.747]
25       (-0.96, -0.829]
26         (0.22, 0.351]
27        (1.007, 1.138]
28        (0.0887, 0.22]
29        (1.925, 2.056]
             ...
970       (0.613, 0.745]
971     (-1.223, -1.092]
972     (-0.305, -0.174]
973       (1.663, 1.794]
974      (-0.96, -0.829]
975      (-2.01, -1.879]
976     (-0.829, -0.698]
977      (-1.092, -0.96]
978     (-0.567, -0.436]
979     (-0.829, -0.698]
980    (-0.174, -0.0424]
981     (-0.567, -0.436]
982     (-0.436, -0.305]
983     (-0.829, -0.698]
984       (1.138, 1.269]
985        (0.22, 0.351]
986     (-1.616, -1.485]
987       (0.351, 0.482]
988     (-1.354, -1.223]
989       (0.0887, 0.22]
990       (1.007, 1.138]
991       (0.876, 1.007]
992     (-2.797, -2.665]
993        (0.22, 0.351]
994     (-0.436, -0.305]
995         (1.269, 1.4]
996       (0.482, 0.613]
997       (0.351, 0.482]
998     (-0.436, -0.305]
999     (-0.305, -0.174]
Name: data1, Length: 1000, dtype: category
Categories (50, interval[float64]): [(-3.197, -3.059] < (-3.059, -2.928] < (-2.928, -2.797] < (-2.797, -2.665] ... (2.843, 2.974] < (2.974, 3.105] < (3.105, 3.236] < (3.236, 3.368]]

In [126]:
grouped.apply(get_stats).unstack()

                   count       max      mean       min
data1
(-3.197, -3.059]     2.0  2.254903  0.417034 -1.420834
(-3.059, -2.928]     0.0       NaN       NaN       NaN
(-2.928, -2.797]     0.0       NaN       NaN       NaN
(-2.797, -2.665]     4.0  1.228239  0.788537  0.211022
(-2.665, -2.534]     0.0       NaN       NaN       NaN
(-2.534, -2.403]     4.0  0.795125 -0.233737 -0.920799
(-2.403, -2.272]     3.0  2.841813  0.823838 -0.443510
(-2.272, -2.141]     6.0  2.154892 -0.654973 -2.170964
(-2.141, -2.01]      4.0  0.441118 -0.315693 -0.818919
(-2.01, -1.879]      7.0  1.897918  0.319298 -1.305402
(-1.879, -1.747]    12.0  1.566647 -0.179732 -2.080360
(-1.747, -1.616]    15.0  1.559663  0.087598 -1.720648
(-1.616, -1.485]    22.0  1.195228 -0.266079 -2.369012
(-1.485, -1.354]    20.0  2.215142  0.072153 -1.178699
(-1.354, -1.223]    25.0  1.826302 -0.119485 -2.904398
(-1.223, -1.092]    24.0  2.088205 -0.021888 -1.526320
(-1.092, -0.96]     31.0  2.748626  0.166236 -2.107227
(-0.96, -0.829]     33.0  1.727188 -0.079684 -3.191051
(-0.829, -0.698]    38.0  2.037847  0.044849 -2.390451
(-0.698, -0.567]    47.0  3.930004 -0.110657 -2.752032
(-0.567, -0.436]    50.0  3.215620  0.082921 -2.088413
(-0.436, -0.305]    48.0  2.490386  0.112334 -2.438866
(-0.305, -0.174]    52.0  1.361895 -0.271140 -2.109113
(-0.174, -0.0424]   53.0  1.918523  0.090110 -2.380195
(-0.0424, 0.0887]   41.0  3.057170 -0.151803 -1.953393
(0.0887, 0.22]      50.0  1.946188  0.089492 -2.410126
(0.22, 0.351]       57.0  1.988510 -0.060053 -3.010762
(0.351, 0.482]      45.0  2.864255  0.112823 -1.904624
(0.482, 0.613]      35.0  2.260063  0.054337 -1.997573
(0.613, 0.745]      40.0  1.642496 -0.097039 -1.744713
(0.745, 0.876]      24.0  2.579823  0.401170 -1.745421
(0.876, 1.007]      33.0  2.245067  0.181793 -2.500567
(1.007, 1.138]      29.0  2.428449  0.315384 -2.977046
(1.138, 1.269]      27.0  1.725022 -0.291274 -2.541086
(1.269, 1.4]        27.0  2.133074 -0.009816 -1.514808
(1.4, 1.531]        22.0  1.757881 -0.134666 -2.173896
(1.531, 1.663]      14.0  1.663389 -0.252479 -1.989131
(1.663, 1.794]      16.0  1.488125 -0.445080 -1.988498
(1.794, 1.925]      11.0  1.112381  0.037986 -1.584807
(1.925, 2.056]      10.0  1.657665  0.123776 -1.737898
(2.056, 2.187]       4.0  1.218929 -0.006150 -1.573545
(2.187, 2.318]       3.0  2.096651 -0.245767 -3.189605
(2.318, 2.45]        5.0  0.591627 -0.156085 -0.869357
(2.45, 2.581]        1.0 -0.806951 -0.806951 -0.806951
(2.581, 2.712]       2.0  1.060145  0.832093  0.604040
(2.712, 2.843]       1.0  0.255403  0.255403  0.255403
(2.843, 2.974]       0.0       NaN       NaN       NaN
(2.974, 3.105]       1.0 -1.099103 -1.099103 -1.099103
(3.105, 3.236]       0.0       NaN       NaN       NaN
(3.236, 3.368]       2.0 -0.115067 -0.416339 -0.717610